nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/driver_examples/lpi2c/interrupt/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define GPIO_PUR_PU_14_MASK 0x4000u /*!<@brief Pull Resistor Enable Bits Mask for item 14. */
#define GPIO_PUR_PU_4_MASK 0x10u    /*!<@brief Pull Resistor Enable Bits Mask for item 4. */
#define GPIO_PUR_PU_5_MASK 0x20u    /*!<@brief Pull Resistor Enable Bits Mask for item 5. */
#define PUR_PU_14_DISABLED 0x00u    /*!<@brief Pull Resistor Enable Bits: Pull resistor is disabled */
#define PUR_PU_4_ENABLED 0x10u      /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */
#define PUR_PU_5_ENABLED 0x20u      /*!<@brief Pull Resistor Enable Bits: Pull resistor is enabled */

/*! @name GPIOC1 (number 4), Y1[3]/XTAL
  @{ */
#define BOARD_XTAL_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BOARD_XTAL_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BOARD_XTAL_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOC11 (number 37), U16[25]/TXD1
  @{ */
#define BOARD_TXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_TXD1_PIN 11U              /*!<@brief GPIOC pin index: 11 */
#define BOARD_TXD1_PIN_MASK kGPIO_Pin11 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC12 (number 38), U16[26]/RXD1
  @{ */
#define BOARD_RXD1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_RXD1_PIN 12U              /*!<@brief GPIOC pin index: 12 */
#define BOARD_RXD1_PIN_MASK kGPIO_Pin12 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOC14 (number 55), J2[18]/LP_SDA0
  @{ */
#define BOARD_LP_SDA0_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_LP_SDA0_PIN 14U              /*!<@brief GPIOC pin index: 14 */
#define BOARD_LP_SDA0_PIN_MASK kGPIO_Pin14 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOC15 (number 56), J2[20]/LP_SCL0
  @{ */
#define BOARD_LP_SCL0_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BOARD_LP_SCL0_PIN 15U              /*!<@brief GPIOC pin index: 15 */
#define BOARD_LP_SCL0_PIN_MASK kGPIO_Pin15 /*!<@brief PORT pin mask */
                                           /* @} */

/*! @name GPIOE4 (number 51), J3[5]/U15E[11]/PWMA_2B
  @{ */
#define BOARD_LED4_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED4_PIN 4U              /*!<@brief GPIOE pin index: 4 */
#define BOARD_LED4_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                       /* @} */

/*! @name GPIOE5 (number 52), J3[7]/U15F[13]/PWMA_2A
  @{ */
#define BOARD_LED5_GPIO GPIOE          /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED5_PIN 5U              /*!<@brief GPIOE pin index: 5 */
#define BOARD_LED5_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
